Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
terms" {
        id                  = "agir-ky72wpi2p8-czxq7s-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants has changed
  ~ resource "aws_api_gateway_integration_response" "g_variants" {
        id                  = "agir-ky72wpi2p8-co54ib-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id has changed
  ~ resource "aws_api_gateway_integration_response" "g_variants-id" {
        id                  = "agir-ky72wpi2p8-5yh5kq-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples has changed
  ~ resource "aws_api_gateway_integration_response" "g_variants-id-biosamples" {
        id                  = "agir-ky72wpi2p8-51sw99-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post has changed
  ~ resource "aws_api_gateway_integration_response" "g_variants-id-biosamples_post" {
        id                  = "agir-ky72wpi2p8-51sw99-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals has changed
  ~ resource "aws_api_gateway_integration_response" "g_variants-id-individuals" {
        id                  = "agir-ky72wpi2p8-vzts4h-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post has changed
  ~ resource "aws_api_gateway_integration_response" "g_variants-id-individuals_post" {
        id                  = "agir-ky72wpi2p8-vzts4h-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post has changed
  ~ resource "aws_api_gateway_integration_response" "g_variants-id_post" {
        id                  = "agir-ky72wpi2p8-5yh5kq-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.g_variants_post has changed
  ~ resource "aws_api_gateway_integration_response" "g_variants_post" {
        id                  = "agir-ky72wpi2p8-co54ib-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals has changed
  ~ resource "aws_api_gateway_integration_response" "individuals" {
        id                  = "agir-ky72wpi2p8-ne73hz-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms has changed
  ~ resource "aws_api_gateway_integration_response" "individuals-filtering_terms" {
        id                  = "agir-ky72wpi2p8-4dwxxj-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post has changed
  ~ resource "aws_api_gateway_integration_response" "individuals-filtering_terms_post" {
        id                  = "agir-ky72wpi2p8-4dwxxj-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id has changed
  ~ resource "aws_api_gateway_integration_response" "individuals-id" {
        id                  = "agir-ky72wpi2p8-pvshcp-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples has changed
  ~ resource "aws_api_gateway_integration_response" "individuals-id-biosamples" {
        id                  = "agir-ky72wpi2p8-b71mwn-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post has changed
  ~ resource "aws_api_gateway_integration_response" "individuals-id-biosamples_post" {
        id                  = "agir-ky72wpi2p8-b71mwn-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants has changed
  ~ resource "aws_api_gateway_integration_response" "individuals-id-g_variants" {
        id                  = "agir-ky72wpi2p8-nb8jpb-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post has changed
  ~ resource "aws_api_gateway_integration_response" "individuals-id-g_variants_post" {
        id                  = "agir-ky72wpi2p8-nb8jpb-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals-id_post has changed
  ~ resource "aws_api_gateway_integration_response" "individuals-id_post" {
        id                  = "agir-ky72wpi2p8-pvshcp-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.individuals_post has changed
  ~ resource "aws_api_gateway_integration_response" "individuals_post" {
        id                  = "agir-ky72wpi2p8-ne73hz-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.info has changed
  ~ resource "aws_api_gateway_integration_response" "info" {
        id                  = "agir-ky72wpi2p8-n26xlx-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.map has changed
  ~ resource "aws_api_gateway_integration_response" "map" {
        id                  = "agir-ky72wpi2p8-hyc7yw-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.projects has changed
  ~ resource "aws_api_gateway_integration_response" "projects" {
        id                  = "agir-ky72wpi2p8-zo7l79-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.root-get has changed
  ~ resource "aws_api_gateway_integration_response" "root-get" {
        id                  = "agir-ky72wpi2p8-qbxx66kvth-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs has changed
  ~ resource "aws_api_gateway_integration_response" "runs" {
        id                  = "agir-ky72wpi2p8-g0qzr0-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms has changed
  ~ resource "aws_api_gateway_integration_response" "runs-filtering_terms" {
        id                  = "agir-ky72wpi2p8-hw3xb9-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post has changed
  ~ resource "aws_api_gateway_integration_response" "runs-filtering_terms_post" {
        id                  = "agir-ky72wpi2p8-hw3xb9-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id" {
        id                  = "agir-ky72wpi2p8-u79hza-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id-analyses" {
        id                  = "agir-ky72wpi2p8-t53ner-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id-analyses_post" {
        id                  = "agir-ky72wpi2p8-t53ner-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id-g_variants" {
        id                  = "agir-ky72wpi2p8-8lyx0p-GET-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id-g_variants_post" {
        id                  = "agir-ky72wpi2p8-8lyx0p-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id_post has changed
  ~ resource "aws_api_gateway_integration_response" "runs-id_post" {
        id                  = "agir-ky72wpi2p8-u79hza-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs_post has changed
  ~ resource "aws_api_gateway_integration_response" "runs_post" {
        id                  = "agir-ky72wpi2p8-g0qzr0-POST-200"
      + response_parameters = {}
        # (8 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.admin_proxy has changed
  ~ resource "aws_api_gateway_method" "admin_proxy" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-ujpptd-ANY"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses has changed
  ~ resource "aws_api_gateway_method" "analyses" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-p7zt2j-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id has changed
  ~ resource "aws_api_gateway_method" "analyses-id" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-flglb0-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "analyses-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-3o1rqt-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "analyses-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-3o1rqt-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id_post has changed
  ~ resource "aws_api_gateway_method" "analyses-id_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-flglb0-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.analyses_post has changed
  ~ resource "aws_api_gateway_method" "analyses_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-p7zt2j-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples has changed
  ~ resource "aws_api_gateway_method" "biosamples" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-meabu1-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "biosamples-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-np2d55-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-np2d55-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id has changed
  ~ resource "aws_api_gateway_method" "biosamples-id" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-av6e44-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-analyses" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-4l7gbp-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-analyses_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-4l7gbp-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-o7rm04-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-o7rm04-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-runs" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-c1t5mg-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id-runs_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-c1t5mg-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id_post has changed
  ~ resource "aws_api_gateway_method" "biosamples-id_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-av6e44-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples_post has changed
  ~ resource "aws_api_gateway_method" "biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-meabu1-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.configuration has changed
  ~ resource "aws_api_gateway_method" "configuration" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-eai7yn-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets has changed
  ~ resource "aws_api_gateway_method" "datasets" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-b04n9x-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "datasets-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-suiury-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "datasets-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-suiury-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id has changed
  ~ resource "aws_api_gateway_method" "datasets-id" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-fn4f3m-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "datasets-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-bdmk7f-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-bdmk7f-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "datasets-id-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-txkwvf-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-txkwvf-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "datasets-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-jaggcw-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-jaggcw-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals has changed
  ~ resource "aws_api_gateway_method" "datasets-id-individuals" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-ikfmsc-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id-individuals_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-ikfmsc-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id_post has changed
  ~ resource "aws_api_gateway_method" "datasets-id_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-fn4f3m-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.datasets_post has changed
  ~ resource "aws_api_gateway_method" "datasets_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-b04n9x-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.dportal_proxy has changed
  ~ resource "aws_api_gateway_method" "dportal_proxy" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-ox9imt-ANY"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.entry_types has changed
  ~ resource "aws_api_gateway_method" "entry_types" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-7fz2zs-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.filtering_terms has changed
  ~ resource "aws_api_gateway_method" "filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-czxq7s-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants has changed
  ~ resource "aws_api_gateway_method" "g_variants" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-co54ib-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id has changed
  ~ resource "aws_api_gateway_method" "g_variants-id" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-5yh5kq-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-51sw99-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-51sw99-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-individuals" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-vzts4h-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id-individuals_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-vzts4h-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id_post has changed
  ~ resource "aws_api_gateway_method" "g_variants-id_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-5yh5kq-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants_post has changed
  ~ resource "aws_api_gateway_method" "g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-co54ib-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals has changed
  ~ resource "aws_api_gateway_method" "individuals" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-ne73hz-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "individuals-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-4dwxxj-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "individuals-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-4dwxxj-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id has changed
  ~ resource "aws_api_gateway_method" "individuals-id" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-pvshcp-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples has changed
  ~ resource "aws_api_gateway_method" "individuals-id-biosamples" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-b71mwn-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id-biosamples_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-b71mwn-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "individuals-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-nb8jpb-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-nb8jpb-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id_post has changed
  ~ resource "aws_api_gateway_method" "individuals-id_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-pvshcp-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.individuals_post has changed
  ~ resource "aws_api_gateway_method" "individuals_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-ne73hz-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.info has changed
  ~ resource "aws_api_gateway_method" "info" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-n26xlx-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.map has changed
  ~ resource "aws_api_gateway_method" "map" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-hyc7yw-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.projects has changed
  ~ resource "aws_api_gateway_method" "projects" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-zo7l79-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.root-get has changed
  ~ resource "aws_api_gateway_method" "root-get" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-qbxx66kvth-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs has changed
  ~ resource "aws_api_gateway_method" "runs" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-g0qzr0-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-hw3xb9-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post has changed
  ~ resource "aws_api_gateway_method" "runs-filtering_terms_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-hw3xb9-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id has changed
  ~ resource "aws_api_gateway_method" "runs-id" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-u79hza-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-t53ner-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-analyses_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-t53ner-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-8lyx0p-GET"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants_post has changed
  ~ resource "aws_api_gateway_method" "runs-id-g_variants_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-8lyx0p-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id_post has changed
  ~ resource "aws_api_gateway_method" "runs-id_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-u79hza-POST"
      + request_models       = {}
        # (10 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_method.runs_post has changed
  ~ resource "aws_api_gateway_method" "runs_post" {
      + authorization_scopes = []
        id                   = "agm-ky72wpi2p8-g0qzr0-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.pgxflow[0].aws_api_gateway_deployment.PgxApi must be replaced
+/- resource "aws_api_gateway_deployment" "PgxApi" {
      ~ created_date = "2026-02-02T03:10:18Z" -> (known after apply)
      ~ id           = "po76n9" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "redeployment" = "3acdc0cc045517dbdbbaa357d2b1a3531e7a2bcc" -> "323cbfc4c7ddad43964780eb2caa1a5869644a97"
        }
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_stage.PgxApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "PgxApi" {
      ~ deployment_id         = "po76n9" -> (known after apply)
        id                    = "ags-8qf7o8qubi-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer:1" -> (known after apply)
      ~ code_sha256                 = "kVkA1ZI6CRaslkRm5wl4V5b8lvA1mgv35iQMkJHxp2o=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-02T02:55:52.909+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "kVkA1ZI6CRaslkRm5wl4V5b8lvA1mgv35iQMkJHxp2o=" -> "eA7ZBjPl4z8wh1KgKEpu4g3wcNU9tqd64V5QUqhVRpE=" # forces replacement
      ~ source_code_size            = 15292784 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_deployment.BeaconApi must be replaced
+/- resource "aws_api_gateway_deployment" "BeaconApi" {
      ~ created_date = "2026-02-02T03:09:47Z" -> (known after apply)
      ~ id           = "w2kfee" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "redeployment" = "33a6988c16c8b2798ef28751030ed167b32415fb" -> "e268197951e12d937f908d6e7b0d290b91fa7241"
        }
        # (3 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "BeaconApi" {
      ~ deployment_id         = "w2kfee" -> (known after apply)
        id                    = "ags-ky72wpi2p8-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_binaries_layer:1" -> (known after apply)
      ~ code_sha256                 = "cG9FM7d12dLnBfmuD6z8m+a1x4o4qIvHC2d731D2Mt0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-02T03:07:47.668+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_binaries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "dyKfa/4tjwHb0bDjxJF5f16Duj6fw31taCAakmhpa28vT8yf2NGgoslP59U/IlmCjCBpcaUaGkV76zz2TTS/3g==" -> "ytMwzog6txaAHg+OVqV0szU9CvHRXPFC1WtThPT9ZP5D+/eU1OgAR6c3k1AHYzoTCMO5tiuBALEP0GOmb+lNBQ==" # forces replacement
      ~ source_code_size            = 18449774 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal20260202025003434800000002"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "s3_access_from_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::webgui-bucket-20260202024950148600000001/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::997141225542:distribution/E2B7ZFHIXFBDR9",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.webgui.aws_cloudfront_distribution.bui-s3-distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "bui-s3-distribution" {
      ~ aliases                         = [
          - "rsjpduat02.xapiens.id",
        ]
      ~ http_version                    = "http1.1" -> "http2and3"
        id                              = "E2B7ZFHIXFBDR9"
        tags                            = {
            "Environment" = "dev"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
        # (23 unchanged attributes hidden)

      ~ viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:997141225542:certificate/d7c7dd78-a356-41cd-8a57-ba7b98e9fbcd" -> null
          ~ cloudfront_default_certificate = false -> true
          ~ minimum_protocol_version       = "TLSv1.2_2021" -> "TLSv1"
          - ssl_support_method             = "sni-only" -> null
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront will be updated in-place
  ~ resource "aws_s3_bucket_policy" "s3_access_from_cloudfront" {
        id     = "webgui-bucket-20260202024950148600000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::997141225542:distribution/E2B7ZFHIXFBDR9"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::webgui-bucket-20260202024950148600000001/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      - content                       = "v1.2.1-63-gd4c4979d+" -> null
        id                            = "webgui-bucket-20260202024950148600000001/version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "8902793689596064713" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "f6879fd03754cb9e980096b255aeb35cb9701e0a" -> "19b111c11bfc647620c2fe7ad2404a6b31002e74"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "4860453378112045280" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "f6879fd03754cb9e980096b255aeb35cb9701e0a" -> "19b111c11bfc647620c2fe7ad2404a6b31002e74"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "c2b0d03e-4208-d3a9-154d-047a42694d74" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.2.1-63-gd4c4979d+" -> "",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip" -> "builds/a6cebdb603d5209d3bec6444a9b3de7b1df279d4240ec17cd165a8910ddaae65.zip"
        id                             = "cognito-customMessageLambdaTrigger"
      ~ last_modified                  = "2026-02-02T02:52:10.871+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
        # (29 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "cognito/lambda/customMessageLambdaTrigger/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "cognito/lambda/customMessageLambdaTrigger",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a6cebdb603d5209d3bec6444a9b3de7b1df279d4240ec17cd165a8910ddaae65.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a6cebdb603d5209d3bec6444a9b3de7b1df279d4240ec17cd165a8910ddaae65.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8527521701123721315" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip" -> "builds/a6cebdb603d5209d3bec6444a9b3de7b1df279d4240ec17cd165a8910ddaae65.zip"
          ~ "timestamp" = "1770000560351039800" -> "1770967299247536800"
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip" -> "builds/f6b1b54ddc431d26a6d0a0ded6dc8e8f57228b13fa0c087cbea7ed9f43790f05.zip"
        id                             = "cognito-logEmailDelivery"
      ~ last_modified                  = "2026-02-02T02:52:21.998+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
        # (29 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "cognito/lambda/logEmailDelivery",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f6b1b54ddc431d26a6d0a0ded6dc8e8f57228b13fa0c087cbea7ed9f43790f05.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f6b1b54ddc431d26a6d0a0ded6dc8e8f57228b13fa0c087cbea7ed9f43790f05.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9195054158197766916" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip" -> "builds/f6b1b54ddc431d26a6d0a0ded6dc8e8f57228b13fa0c087cbea7ed9f43790f05.zip"
          ~ "timestamp" = "1770000561133355000" -> "1770967299356107000"
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip" -> "builds/385f010520f1e15275fbef603751d350400e4dfe35f882a5d0b82cdaba54bcf4.zip"
        id                             = "cognito-sendClinicJobEmail"
      ~ last_modified                  = "2026-02-02T02:52:05.169+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "cognito/lambda/sendClinicJobEmail/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "cognito/lambda/sendClinicJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/385f010520f1e15275fbef603751d350400e4dfe35f882a5d0b82cdaba54bcf4.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/385f010520f1e15275fbef603751d350400e4dfe35f882a5d0b82cdaba54bcf4.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4617651942037734896" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip" -> "builds/385f010520f1e15275fbef603751d350400e4dfe35f882a5d0b82cdaba54bcf4.zip"
          ~ "timestamp" = "1770000562052007000" -> "1770967299313178000"
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2e022d7607908b6af52b4df044f238c65f6251e246c7c410578e26f575cb1f4b.zip" -> "builds/a9b8ed09838dc3f447008547423c0ea442c5f437d885044fe32b840901f5f33d.zip"
        id                             = "cognito-sendRegistrationEmail"
      ~ last_modified                  = "2026-02-02T02:52:16.441+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "cognito/lambda/sendRegistrationEmail/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "cognito/lambda/sendRegistrationEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a9b8ed09838dc3f447008547423c0ea442c5f437d885044fe32b840901f5f33d.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a9b8ed09838dc3f447008547423c0ea442c5f437d885044fe32b840901f5f33d.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2272607681787826714" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2e022d7607908b6af52b4df044f238c65f6251e246c7c410578e26f575cb1f4b.zip" -> "builds/a9b8ed09838dc3f447008547423c0ea442c5f437d885044fe32b840901f5f33d.zip"
          ~ "timestamp" = "1770000560942796000" -> "1770967297640658000"
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip" -> "builds/2b326426c8c8d76483c5b4edee70c9d96e15a274809a83e41cee00c25c0d9371.zip"
        id                             = "error-catcher-notifyOnError"
      ~ last_modified                  = "2026-02-02T02:52:13.627+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "error-catcher"
            "Owner"       = "gaspi"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "error_catcher/lambda/notifyOnError",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2b326426c8c8d76483c5b4edee70c9d96e15a274809a83e41cee00c25c0d9371.zip"
              + quiet         = "true"
              + runtime       = "python3.13"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2b326426c8c8d76483c5b4edee70c9d96e15a274809a83e41cee00c25c0d9371.plan.json"
      + id                   = (known after apply)
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5449443150496798374" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip" -> "builds/2b326426c8c8d76483c5b4edee70c9d96e15a274809a83e41cee00c25c0d9371.zip"
          ~ "timestamp" = "1770000561520927000" -> "1770967301846359000"
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:fcb765d515c8eb6c66588ea28aa343055787eb627b080a9e351a1204b9069420997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:fcb765d515c8eb6c66588ea28aa343055787eb627b080a9e351a1204b9069420" -> (known after apply)
        name         = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ repo_digest  = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers@sha256:212559ac8822cfab6e0711697fbdaaf7c576beb700b99a143e3be583cbc5dab2" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "d3bd04fba8359170a09db1bebb6fdcc926d38e1b" -> "6c375b41e42dedfc75ceb7613dbd1af3043e1874"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:212559ac8822cfab6e0711697fbdaaf7c576beb700b99a143e3be583cbc5dab2" -> (known after apply)
        name                 = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:212559ac8822cfab6e0711697fbdaaf7c576beb700b99a143e3be583cbc5dab2" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "d3bd04fba8359170a09db1bebb6fdcc926d38e1b" -> "6c375b41e42dedfc75ceb7613dbd1af3043e1874"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip" -> "builds/df666d28684736d968bf528df2d4ec342ae4eb3944dd55592e35f2e880c83888.zip"
        id                             = "pgxflow-backend-batchStarter"
      ~ last_modified                  = "2026-02-02T02:52:33.399+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/batchStarter",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/df666d28684736d968bf528df2d4ec342ae4eb3944dd55592e35f2e880c83888.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/df666d28684736d968bf528df2d4ec342ae4eb3944dd55592e35f2e880c83888.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5077865710149707476" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip" -> "builds/df666d28684736d968bf528df2d4ec342ae4eb3944dd55592e35f2e880c83888.zip"
          ~ "timestamp" = "1770000561543283000" -> "1770967310192281000"
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip" -> "builds/027a0346339117335d14e42a619355d0aab4a0bedcf0ff1e491fc69f136b23b1.zip"
        id                             = "pgxflow-backend-batchSubmit"
      ~ last_modified                  = "2026-02-02T02:52:39.052+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/batchSubmit",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/027a0346339117335d14e42a619355d0aab4a0bedcf0ff1e491fc69f136b23b1.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/027a0346339117335d14e42a619355d0aab4a0bedcf0ff1e491fc69f136b23b1.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6731720683461670444" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip" -> "builds/027a0346339117335d14e42a619355d0aab4a0bedcf0ff1e491fc69f136b23b1.zip"
          ~ "timestamp" = "1770000562349368000" -> "1770967310105342000"
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ reso
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.